# Напишите программу, которая принимает три числа и выдаёт максимальное из них

print(str(max(int(input()),int(input()),int(input()))))